{
  "meta.title": "AM Consulting — Hire Tech Talent Faster",
  "meta.description": "Technical founder led sourcing, screening, and outsourcing that removes noise and accelerates hiring.",
  "nav.models": "Models",
  "nav.process": "Process",
  "nav.about": "About",
  "nav.faq": "FAQ",
  "cta.call": "Call",
  "cta.callNow": "Call now: <span dir=\"ltr\">051-299-7867</span>",
  "hero.chip": "Technical founder led",
  "hero.title": "Hire Tech Talent Faster Without the Noise",
  "hero.lead": "Your delivery is blocked by open roles. We remove the hiring drag by sending only engineering validated candidates, cutting interview waste and compressing time to hire.",
  "hero.primaryCta": "Call now: <span dir=\"ltr\">051-299-7867</span>",
  "hero.secondaryCta": "Email: office@amconsultingai.com",
  "hero.trust1": "Cuts 90% screening noise",
  "hero.trust2": "Faster, decision ready shortlists",
  "hero.trust3": "Flexible engagement",
  "img.heroAlt": "Recruiter and candidate in a focused interview",
  "problem.title": "Hiring stalls your roadmap. Let’s unblock it",
  "problem.lead": "Open roles slow delivery and drain manager hours. Typical agencies send volume, not signal, so you spend months interviewing the wrong people. We start from your business goals and role outcomes, then screen for proven ability to deliver those outcomes, so every interview is worth your time.",
  "problem.cardTitle": "We do what typical sourcing can't",
  "problem.b1": "<strong>Less waste</strong>: We filter out ~90% mismatches before they hit your calendar.",
  "problem.b2": "<strong>Real evaluation</strong>: Hands on technical interviews validate skills for your stack.",
  "problem.b3": "<strong>Predictable flow</strong>: A cadence of decision ready candidates keeps momentum.",
  "problem.b4": "<strong>Faster time to hire</strong>: Structured process compresses weeks and reduces context switching.",
  "models.title": "Pick the engagement that fits your requirements",
  "models.m1.tag": "Model 1",
  "models.m1.title": "Outsourcing Service",
  "models.m1.text": "Need impact now? Start shipping with vetted talent from us.",
  "models.m1.b1": "<strong>Stop the hiring overhead</strong>: Managers avoid sourcing and early screening work.",
  "models.m1.b2": "<strong>Simple commercials</strong>: No equity or employer and employee relation, a straightforward invoice.",
  "models.m1.b3": "<strong>Convert when ready</strong>: Hire as FTE later if it is a fit, with no strings attached.",
  "models.m2.tag": "Model 2",
  "models.m2.title": "Sourcing Services",
  "models.m2.text": "Drowning in resumes? We keep your funnel full of pre screened, role fit candidates.",
  "models.m2.b1": "<strong>Technical first</strong>: Candidates pass an engineering led screen before you see them.",
  "models.m2.b2": "<strong>90% less noise</strong>: Focus interviews on realistic contenders only.",
  "models.m2.b3": "<strong>Reliable cadence</strong>: Predictable weekly submissions you can plan around.",
  "models.m3.tag": "Model 3",
  "models.m3.title": "Screening Service",
  "models.m3.text": "Already have resumes? Hand off the heavy lifting and get a ranked shortlist.",
  "models.m3.b1": "We handle resume triage through full technical interviews.",
  "models.m3.b2": "Receive notes, risk flags, and a clear go or no go for each candidate.",
  "models.cta": "Unsure which model? Let’s decide in 10 minutes. Call <span dir=\"ltr\">051-299-7867</span>",
  "process.title": "A process that saves your team time",
  "process.s1.t": "Align on outcomes",
  "process.s1.d": "We translate your delivery goals into a scorecard, so we screen for impact, not buzzwords.",
  "process.s2.t": "Target profile",
  "process.s2.d": "Clear must haves and trade offs keep interviews focused and consistent.",
  "process.s3.t": "Sourcing and pre screen",
  "process.s3.d": "Active outreach and structured resume triage remove low signal profiles.",
  "process.s4.t": "Deep technical evaluation",
  "process.s4.d": "Hands on exercises and scenario questions verify real world problem solving.",
  "process.s5.t": "Curated shortlist",
  "process.s5.d": "You meet 2 to 5 decision ready finalists with notes and risk flags.",
  "process.s6.t": "Offer and start",
  "process.s6.d": "Faster closes and smooth onboarding to maintain momentum.",
  "process.s7.t": "Post start check ins",
  "process.s7.d": "Early course corrections protect team throughput.",
  "about.title": "Why managers choose AM Consulting",
  "about.lead": "You need hires who move the roadmap, not just pass a keyword screen. Our team is led by Avishay Meron, an engineering leader who built and managed teams, and we evaluate like peers then send only candidates who can deliver on your outcomes.",
  "about.b1": "<strong>Engineer validated</strong>: Every candidate is assessed by a technical leader before you invest time.",
  "about.b2": "<strong>Fewer interviews, better signal</strong>: Expect higher first round pass rates from a tighter shortlist.",
  "about.b3": "<strong>Speed without risk</strong>: Structured evaluation accelerates hiring while surfacing trade offs early.",
  "about.note": "Want to see how this applies to your roles? Let’s talk through your stack and team constraints.",
  "about.cta1": "Call <span dir=\"ltr\">051-299-7867</span>",
  "about.cta2": "Email",
  "img.avishayAlt": "Avishay Meron, CEO of AM Consulting",
  "faq.title": "Frequently asked questions",
  "faq.q1": "How fast can we start?",
  "faq.a1": "Discovery can begin this week; first shortlists typically follow within days, not months.",
  "faq.q2": "Do you cover niche stacks?",
  "faq.a2": "Yes. Evaluation is anchored on fundamentals plus role specific scorecards, not just keyword matches.",
  "faq.q3": "What does “technical screening” include?",
  "faq.a3": "Live problem solving, scenario questions, code or portfolio review when available, and structured interviews tailored to your stack.",
  "faq.q4": "Can we hire your outsourced talent full time later?",
  "faq.a4": "Yes, no strings attached.",
  "faq.q5": "What if none of the candidates fit?",
  "faq.a5": "We refine the scorecard quickly and iterate, no wasted cycles on misaligned profiles.",
  "final.title": "Ready to remove the hiring bottleneck?",
  "final.lead": "One call to pick the right model and start a higher signal pipeline.",
  "final.cta1": "Call <span dir=\"ltr\">051-299-7867</span>",
  "final.cta2": "Email: office@amconsultingai.com",
  "footer.tagline": "Technical sourcing, screening, and outsourcing for engineering teams worldwide.",
  "footer.contact.title": "Contact",
  "footer.nav.title": "Navigate"
}
